#!/usr/bin/ruby
#coding:utf-8
def check(n)
	[10,8].all?{|e|
		s=n.to_s(e)
		s==s.reverse
	}
end
puts [0,1] #自明(0.to_s(2)で空文字列ではなく'0'が返ってくるためloop中でこれらを引き出すことは不可能)
start=1
digit=1
loop{
	start.step(start*2-1){|i|
		s=i.to_s(2)
		n=(s+s.reverse).to_i(2)
		p n if check(n)
	}
	start.step(start*2-1){|i|
		s=i.to_s(2)
		['0','1'].each{|mid|
			n=(s+mid+s.reverse).to_i(2)
			p n if check(n)
		}
	}
	start*=2
	digit+=2
	STDERR.puts '[*] '+('1'*digit).to_i(2).to_s
}
#[*]で始まる行は進捗表示
__END__
0
1
3
5
7
[*] 7
9
[*] 31
[*] 127
[*] 511
585
[*] 2047
[*] 8191
[*] 32767
[*] 131071
[*] 524287
[*] 2097151
[*] 8388607
[*] 33554431
[*] 134217727
[*] 536870911
719848917
[*] 2147483647
[*] 8589934591
[*] 34359738367
[*] 137438953471
[*] 549755813887
[*] 2199023255551
[*] 8796093022207
[*] 35184372088831
[*] 140737488355327
[*] 562949953421311
[*] 2251799813685247