#!/usr/bin/php
<?php
$arr = array("あ","い","う","え","お","か","き","く","け","こ","さ","し","す","せ","そ","た","ち","つ","て","と","な","に","ぬ","ね","の","は","ひ","ふ","へ","ほ","ま","み","む","め","も","や","ゆ","よ","ら","り","る","れ","ろ","わ","を","ん","が","ぎ","ぐ","げ","ご","ざ","じ","ず","ぜ","ぞ","だ","ぢ","づ","で","ど","ば","び","ぶ","べ","ぼ","ぱ","ぴ","ぷ","ぺ","ぽ");
$count = count($arr)-1;
for ($a=0;$a<=$count;$a++) {
for ($b=0;$b<=$count;$b++) {
for ($c=0;$c<=$count;$c++) {
for ($d=0;$d<=$count;$d++) {
	//print(md5($arr[$a].$arr[$b].$arr[$c].$arr[$d]));
	if (md5($arr[$a].$arr[$b].$arr[$c].$arr[$d]) === "239363c3075ba1b350aaf62c7e15b574") {
		print($arr[$a].$arr[$b].$arr[$c].$arr[$d]);
		exit;
	}
}
}
}
}
?>